event_schedule/app/controllers/events_controller.rb

  def new
     @event = Event.new
     @users=User.all
---
SELECT "users".* FROM "users"

   def edit
   @event=Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", nil]]

    def update
    @event=Event.find_by_id(params[:event_id])
    @event.update_attributes(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "events" SET "eventtitle" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["eventtitle", "Peak Performance sjdgjs"], ["updated_at", "2016-11-16 08:14:33.439950"], ["id", 1]]

	def create
  	@event = Event.new(event_params)
  	# binding.pry
  	if @event.save
---
INSERT INTO "events" ("eventtitle", "venue", "discription", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["eventtitle", "Scrum Test"], ["venue", "Mysuru"], ["discription", "skjhcslajslhfjsdfvkjsa"], ["created_at", "2016-11-15 10:44:58.965773"], ["updated_at", "2016-11-15 10:44:58.965773"]]