event_schedule/app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "username", "email", "phonenumber", "password_salt", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
	def create
  	@user = User.new(user_params )
  	if @user.save